Repository: renoir01/i_Tracelink
Catalog: lib/l10n/app_*.arb
Languages: rw

# appTagline
source: Tracing Nutrition from Seed to Table
rw: Gukurikirana Intungamubiri kuva ku mbuto kugeza ku meza

source: Welcome
rw: Murakaza neza

source: Welcome Back
rw: Murakaza Neza

# welcomeSubtitle
source: Sign in to continue
rw: Injira kugirango ukomeze

# dontHaveAccount
source: Don't have an account?
rw: Ntabwo ufite konti?

# alreadyHaveAccount
source: Already have an account?
rw: Ufite konti?

# pleaseEnterEmail
source: Please enter your email
rw: Nyamuneka andika imeli yawe

# pleaseEnterValidEmail
source: Please enter a valid email
rw: Nyamuneka andika imeli yemewe

# pleaseEnterPassword
source: Please enter your password
rw: Nyamuneka andika ijambo ryibanga

# passwordTooShort
source: Password must be at least 6 characters
rw: Ijambo ryibanga rigomba kuba nibura inyuguti 6

source: Get Started
rw: Tangira

source: Login
rw: Injira

source: Register
rw: Iyandikishe

source: Logout
rw: Sohoka

source: Submit
rw: Ohereza

source: Cancel
rw: Hagarika

source: Save
rw: Bika

source: Delete
rw: Siba

source: Edit
rw: Hindura

source: Search
rw: Shakisha

source: Filter
rw: Shungura

source: Back
rw: Subira

source: Next
rw: Komeza

source: Finish
rw: Soza

source: Confirm
rw: Emeza

source: Yes
rw: Yego

source: No
rw: Oya

source: Select Language
rw: Hitamo Ururimi

source: English
rw: Icyongereza

source: Kinyarwanda
rw: Ikinyarwanda

# selectUserType
source: Who are you?
rw: Wowe uri iki?

source: Seed Producer
rw: Umushoramari w'Imbuto

source: Agro-Dealer
rw: Ucuruza Imbuto

source: Farmer Cooperative
rw: Koperative y'Abahinzi

source: Aggregator
rw: Uwegeranya

# institution
source: School/Hospital
rw: Ishuri/Ibitaro

# seedProducerDesc
source: Research institutions, seed companies that produce certified iron-biofortified bean seeds
rw: Ibigo by'ubushakashatsi, amasosiyete akora imbuto zemejwe z'ibishyimbo byongereweho icyuma

# agroDealerDesc
source: Input suppliers who stock and sell certified iron-biofortified bean seeds to farmers
rw: Abatanga ibikoresho bacuruza imbuto zemejwe z'ibishyimbo byongereweho icyuma

# farmerCooperativeDesc
source: Bean farmers organized in cooperatives who grow iron-biofortified beans
rw: Abahinzi b'ibishyimbo bateraniye mu koperative bahinga ibishyimbo byongereweho icyuma

# aggregatorDesc
source: Traders who collect beans from cooperatives and sell in bulk to institutions
rw: Abacuruzi bakusanya ibishyimbo muri koperative bagurisha mwinshi mu bigo

# institutionDesc
source: Schools with feeding programs and hospitals that purchase iron beans in bulk
rw: Amashuri afite gahunda zo kugaburira n'ibitaro bigura ibishyimbo by'icyuma mwinshi

source: Phone Number
rw: Nimero ya Telefoni

source: Email
rw: Imeli

source: Password
rw: Ijambo Ryibanga

source: Confirm Password
rw: Emeza Ijambo Ryibanga

source: Forgot Password?
rw: Wibagiwe Ijambo Ryibanga?

source: Enter OTP
rw: Andika Kode

source: Verify OTP
rw: Emeza Kode

source: Resend OTP
rw: Ongera Wohereze Kode

source: Dashboard
rw: Ibanze

source: Profile
rw: Umwirondoro

source: Notifications
rw: Ubutumwa

source: Orders
rw: Amatungo

source: Settings
rw: Igenamiterere

source: Help
rw: Ubufasha

source: Place Order
rw: Saba Ibicuruzwa

source: Accept Order
rw: Emera Itungo

source: Reject Order
rw: Anga Itungo

source: View Order
rw: Reba Itungo

source: Order History
rw: Amateka y'Amatungo

# quantity
source: Quantity (kg)
rw: Ingano (kg)

# price
source: Price (RWF/kg)
rw: Igiciro (RWF/kg)

source: Total Amount
rw: Igiciro Cyose

source: Delivery Date
rw: Itariki yo Gutanga

source: Delivery Location
rw: Aho Bizatangirwa

source: Pending
rw: Bitegerejwe

source: Accepted
rw: Byemewe

source: Rejected
rw: Byanze

source: Completed
rw: Byarangiye

source: Cancelled
rw: Byahagaritswe

source: In Transit
rw: Birimo Gutwara

source: Payment Pending
rw: Amafaranga Ategerejwe

source: Payment Completed
rw: Amafaranga Yishyuwe

source: District
rw: Akarere

source: Sector
rw: Umurenge

source: Cell
rw: Akagari

source: Traceability
rw: Gukurikirana

source: Verify Traceability
rw: Emeza Gukurikirana

source: Full Chain
rw: Uruhererekane Rwuzuye

source: Register Planting
rw: Andikisha Guhinga

source: Update Harvest
rw: Kuvugurura Isarura

source: Planting Date
rw: Itariki yo Gutera

source: Harvest Date
rw: Itariki yo Gusarura

source: Expected Quantity
rw: Ingano Yitejwe

source: Actual Quantity
rw: Ingano Nyayo

source: Search Farmers
rw: Shakisha Abahinzi

source: Find Farmers
rw: Shaka Abahinzi

source: View Bids
rw: Reba Amatungo

source: Submit Bid
rw: Ohereza Isoko

source: Post Requirement
rw: Tanga Ibikenewe

source: Monthly Requirement
rw: Ibikenewe bya Buri Kwezi

source: Update Inventory
rw: Kuvugurura Ububiko

source: Record Sale
rw: Andika Igurisha

source: Sales History
rw: Amateka y'Igurisha

source: Contact Support
rw: Hamagara Ubufasha

source: Terms and Conditions
rw: Amabwiriza n'Amategeko

source: Privacy Policy
rw: Amategeko y'Ibanga

source: Loading...
rw: Birimo Gupakira...

source: Error
rw: Ikosa

source: Success
rw: Byagenze Neza

# noData
source: No data available
rw: Nta makuru aboneka

source: Try Again
rw: Ongera Ugerageze
